#+TITLE: Array Temperature Analysis
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Data Structures with C++ - Lyon College - Fall 2024
#+STARTUP: overview hideblocks indent
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output

#+begin_src C
  /******************************************************************/
  // Analyze weekly temperature data, compute maximum, minimum,
  // averages, modified temperatures. Author: Marcus Birkenkrahe
  // Input: temperature array (float)
  // Output: highest, lowest, average temperature, number of days
  //         above average temperature, temperatures increased by 2
  // License: GPLv3 - V1 (without user input)
  /******************************************************************/
  // Declare constant array size
  #define SIZE 7

  // Declare array to hold the temperature
  float temp[SIZE] = {82.3,79.5,79.9,84.1,86.2,70.3,77.7};

  // Declare other variables
  int i;
  float max, min, avg, sum=0.;
  int days_above_avg = 0;

  // Use a loop to display the temperatures
  printf("Temperatures Mon-Sun:\n");
  for (i = 0; i < SIZE; i++)
    printf("%g ", temp[i]);

  // Find highest & lowest temperature
  min = max = temp[0];
  for (i = 0; i < SIZE; i++) {
    if (temp[i] < min)
      min = temp[i];
    if (temp[i] > max)
      max = temp[i];
   }
  printf("\nLowest temperature = %g\nHighest temperature = %g\n", min, max);

  // Calculate the average temperature using a loop
  for (i = 0; i < SIZE; i++) 
    sum += temp[i];

  avg = sum / SIZE;
  printf("Average temperature = %g\n", avg);

  // Count days above average using a loop and a conditional statement
  for (i = 0; i < SIZE; i++) {
    if (temp[i] > avg)
      days_above_avg++;
   }
  printf("Days above average temperature = %d\n", days_above_avg);

  // Modify the array by adding 2 degrees to each temperature
  printf("Modified temperatures Mon-Sun:\n");
  for (i = 0; i < SIZE; i++) {
    temp[i]+=2.;
    printf("%g ", temp[i]);
   }
#+end_src

#+RESULTS:
: Temperatures Mon-Sun:
: 82.3 79.5 79.9 84.1 86.2 70.3 77.7 
: Lowest temperature = 70.3
: Highest temperature = 86.2
: Average temperature = 80
: Days above average temperature = 3
: Modified temperatures Mon-Sun:
: 84.3 81.5 81.9 86.1 88.2 72.3 79.7 
